In [74]:
import pandas as pd
import numpy as np

In [83]:
# load the target data for the test set, provided as a numpy array

target =  np.load('/users/raulmiranda/Desktop/DATA 201 SP 2021/Project 1/jobchange_test_target_values.npy')

In [84]:
len(target)

2129

In [97]:
# load the test set, provided as a CSV file

testdata = pd.read_csv('/users/raulmiranda/Desktop/DATA 201 SP 2021/Project 1/aug_test.csv',sep=',')

In [98]:
len(testdata)

2129

In [99]:
testdata[0:5]  # test data without the target column

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours
0,32403,city_41,0.827,Male,Has relevent experience,Full time course,Graduate,STEM,9,<10,NaN,1,21
1,9858,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,5,NaN,Pvt Ltd,1,98
2,31806,city_21,0.624,Male,No relevent experience,no_enrollment,High School,NaN,<1,NaN,Pvt Ltd,never,15
3,27385,city_13,0.827,Male,Has relevent experience,no_enrollment,Masters,STEM,11,10/49,Pvt Ltd,1,39
4,27724,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,>4,72

In [105]:
target[:5]   #   target array

array([1., 0., 1., 0., 1.])

In [101]:
testdata['target'] = target    #   add the column with targets to testdata

In [106]:
testdata[:5]  #  test data with the target column

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,32403,city_41,0.827,Male,Has relevent experience,Full time course,Graduate,STEM,9,<10,NaN,1,21,1.0
1,9858,city_103,0.920,Female,Has relevent experience,no_enrollment,Graduate,STEM,5,NaN,Pvt Ltd,1,98,0.0
2,31806,city_21,0.624,Male,No relevent experience,no_enrollment,High School,NaN,<1,NaN,Pvt Ltd,never,15,1.0
3,27385,city_13,0.827,Male,Has relevent experience,no_enrollment,Masters,STEM,11,10/49,Pvt Ltd,1,39,0.0
4,27724,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,10000+,Pvt Ltd,>4,72,1.0

In [96]:
# load the training set, provided as a CSV file

training = pd.read_csv('/users/raulmiranda/Desktop/DATA 201 SP 2021/Project 1/aug_train.csv',sep=',')

In [103]:
len(training)

19158

In [107]:
training[:5]

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [108]:
# save the test set with target column included

testdata.to_csv ('/users/raulmiranda/Desktop/DATA 201 SP 2021/Project 1/aug_test1.csv', sep = ',')